// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
Console.WriteLine("Введите число");

int N= Convert.ToInt32(Console.ReadLine());


for (int m=2;m < N; m+=2)

Console.WriteLine(m);

